DataProcessors/СозданиеРеестровСтимулирующихВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>СозданиеРеестровСтимулирующихВыплат</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВедомостьНаВыплатуЗарплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестрСоставил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочтыСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСтрахователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодчиненностиФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПособия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолучательСтимулирующихВыплатФСС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОрганизацииВыявленКоронавирус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеРеестра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРеестровФСС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховойНомерПФР</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВыплатыПособия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыплатыПособия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КартаМИР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеКартыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияПолучателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииПолучателейСтимулирующихВыплатФСС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейКОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СменКОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РайонныйКоэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийСтрахователя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТерриториальныйКоэффициент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТерриторииСПовышающимКоэффициентомПоКоронавирусу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЛицевогоСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗанятости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/СостоянияРеестровФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СостоянияРеестровФСС</Name>
			<Comment>АПК:413 допустима история выбора при вводе, т.к. ОбработкаПолученияДанныхВыбора формирует фиксированный список</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноПринятФСС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПереводНаРаботуСКоронавирусом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПереводНаРаботуСКоронавирусом</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПериодыРаботыСКоронавирусом</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазныеСрокиДляРазныхСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/СозданиеРеестровСтимулирующихВыплат/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Создание_ведомостей 

Функция СоздатьРеестрыПоДокументуПереводНаРаботуСКоронавирусом(ДокументПереводНаРаботуСКоронавирусом) Экспорт
	
	ОбщиеПараметрыЗаполнения = ОбщиеПараметрыЗаполнения(ДокументПереводНаРаботуСКоронавирусом, ДокументПереводНаРаботуСКоронавирусом.Организация);
	РеестрыПоДокументуПереводНаРаботуСКоронавирусом = Новый Массив;
	
	// Зарплата к выплате по документу
	СменыДокументаПереводНаРаботуСКоронавирусом = СменыДокументаПереводНаРаботуСКоронавирусом(ДокументПереводНаРаботуСКоронавирусом);
	
	// Уникальные сочетания ключевых полей будущих ведомостей
	ПоляКлючаРеестра = ПоляКлючаРеестра();
	КлючиРеестров = КлючиРеестров(СменыДокументаПереводНаРаботуСКоронавирусом, ПоляКлючаРеестра);
	Для Каждого ПолеКлючаВедомости Из ПоляКлючаРеестра Цикл
		СменыДокументаПереводНаРаботуСКоронавирусом.Индексы.Добавить(ПолеКлючаВедомости);
	КонецЦикла;
	
	// По каждому ключу создаем реестр
	Для Каждого КлючРеестра Из КлючиРеестров Цикл
				
		СменаРеестра = СменаРеестра(КлючРеестра, СменыДокументаПереводНаРаботуСКоронавирусом);
		
		Если СменаРеестра.Количество() = 0 Тогда
			Продолжить
		КонецЕсли;
		
		Реестр = НовыйРеестрПоКлючу(КлючРеестра, ОбщиеПараметрыЗаполнения, СменаРеестра.ВыгрузитьКолонку("Сотрудник"));
			
		РеестрыПоДокументуПереводНаРаботуСКоронавирусом.Добавить(Реестр);
		
	КонецЦикла;
	
	Возврат РеестрыПоДокументуПереводНаРаботуСКоронавирусом;
	
КонецФункции

Функция ОбщиеПараметрыЗаполнения(ДокументСсылка, Организация)
	
	ОбщиеПараметрыЗаполнения = Новый Структура;
	ОбщиеПараметрыЗаполнения.Вставить("Организация", Организация);
	
	НастройкиКадровогоУчета = КадровыйУчетРасширенный.НастройкиКадровогоУчета();
	ОбщиеПараметрыЗаполнения.Вставить("ВидПособия", НастройкиКадровогоУчета.ПолучательСтимулирующихВыплатФСС);
	
	ИменаРеквизитовОрганизации = "РегистрационныйНомерФСС, КодПодчиненностиФСС, ОГРН";
	ЗначенияРеквизитовОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, ИменаРеквизитовОрганизации);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ОбщиеПараметрыЗаполнения, ЗначенияРеквизитовОрганизации, Истина);
	
	СведенияОПодписях = ПодписиДокументов.СведенияОПодписяхПоУмолчаниюДляОбъектаМетаданных(Метаданные.Документы.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам, Организация);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ОбщиеПараметрыЗаполнения, СведенияОПодписях, Истина);
	
	ДатаПолученияСведений = ТекущаяДатаСеанса();
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, ДатаПолученияСведений, "ТелОрганизации,АдресЭлектроннойПочтыОрганизации,ИННЮЛ,КППЮЛ,НаимЮЛПол");
	ОбщиеПараметрыЗаполнения.Вставить("ИНН", СведенияОбОрганизации.ИННЮЛ);
	ОбщиеПараметрыЗаполнения.Вставить("КПП", СведенияОбОрганизации.КППЮЛ);
	ОбщиеПараметрыЗаполнения.Вставить("НаименованиеСтрахователя", СведенияОбОрганизации.НаимЮЛПол);
	ОбщиеПараметрыЗаполнения.Вставить("ТелефонСоставителя", СведенияОбОрганизации.ТелОрганизации);
	ОбщиеПараметрыЗаполнения.Вставить("АдресЭлектроннойПочтыСоставителя", СведенияОбОрганизации.АдресЭлектроннойПочтыОрганизации);
	ОбщиеПараметрыЗаполнения.Вставить("ВОрганизацииВыявленКоронавирус", Документы.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.ВОрганизацииВыявленКоронавирус(Организация, ДатаПолученияСведений));
	ОбщиеПараметрыЗаполнения.Вставить("СостояниеРеестра", Перечисления.СостоянияРеестровФСС.ВРаботе);
	ОбщиеПараметрыЗаполнения.Вставить("ДокументОснование", ДокументСсылка);
	
	ЗаполняемыеЗначения = Новый Структура;
	ЗаполняемыеЗначения.Вставить("Организация");
	ЗаполняемыеЗначения.Вставить("Ответственный");
	ЗаполнитьЗначенияСвойств(ЗаполняемыеЗначения, ОбщиеПараметрыЗаполнения);
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
	ОбщиеПараметрыЗаполнения.Вставить("Ответственный", ЗаполняемыеЗначения.Ответственный);
	
	Возврат ОбщиеПараметрыЗаполнения;
	
КонецФункции

Функция СменыДокументаПереводНаРаботуСКоронавирусом(ДокументПереводНаРаботуСКоронавирусом)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПереводНаРаботуСКоронавирусом",ДокументПереводНаРаботуСКоронавирусом);
	Запрос.МенеджерВременныхТаблиц =  Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПереводНаРаботуСКоронавирусомСотрудники.ДатаНачала КАК НачалоПериода,
	|	ПереводНаРаботуСКоронавирусомСотрудники.ДатаОкончания КАК ОкончаниеПериода,
	|	ПереводНаРаботуСКоронавирусомСотрудники.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТСменыДокументаПереводНаРаботуСКоронавирусом
	|ИЗ
	|	Документ.ПереводНаРаботуСКоронавирусом.Сотрудники КАК ПереводНаРаботуСКоронавирусомСотрудники
	|ГДЕ
	|	ПереводНаРаботуСКоронавирусомСотрудники.Ссылка = &ДокументПереводНаРаботуСКоронавирусом
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НачалоПериода,
	|	ОкончаниеПериода,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СменыДокументаПереводНаРаботуСКоронавирусом.Сотрудник КАК Сотрудник,
	|	СменыДокументаПереводНаРаботуСКоронавирусом.НачалоПериода КАК НачалоПериода,
	|	СменыДокументаПереводНаРаботуСКоронавирусом.ОкончаниеПериода КАК ОкончаниеПериода,
	|	РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.Ссылка КАК Ссылка,
	|	РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.Дата КАК ДатаРеестра
	|ПОМЕСТИТЬ ВТСозданныеРанееРеестры
	|ИЗ
	|	ВТСменыДокументаПереводНаРаботуСКоронавирусом КАК СменыДокументаПереводНаРаботуСКоронавирусом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам КАК РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам
	|		ПО (РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.ДокументОснование = &ДокументПереводНаРаботуСКоронавирусом)
	|			И (НЕ РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.ПометкаУдаления)
	|			И (РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.НачалоПериода = СменыДокументаПереводНаРаботуСКоронавирусом.НачалоПериода)
	|			И (РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.ОкончаниеПериода = СменыДокументаПереводНаРаботуСКоронавирусом.ОкончаниеПериода)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.Сотрудники КАК РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамСотрудники
	|		ПО (РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.Ссылка = РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамСотрудники.Ссылка)
	|			И (РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникамСотрудники.Сотрудник = СменыДокументаПереводНаРаботуСКоронавирусом.Сотрудник)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СозданныеРанееРеестры.Сотрудник КАК Сотрудник,
	|	СозданныеРанееРеестры.НачалоПериода КАК НачалоПериода,
	|	СозданныеРанееРеестры.ОкончаниеПериода КАК ОкончаниеПериода,
	|	МАКСИМУМ(СозданныеРанееРеестры.ДатаРеестра) КАК ДатаРеестра
	|ПОМЕСТИТЬ ВТСозданныеРанееРеестрыСрез
	|ИЗ
	|	ВТСозданныеРанееРеестры КАК СозданныеРанееРеестры
	|
	|СГРУППИРОВАТЬ ПО
	|	СозданныеРанееРеестры.Сотрудник,
	|	СозданныеРанееРеестры.НачалоПериода,
	|	СозданныеРанееРеестры.ОкончаниеПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СменыДокументаПереводНаРаботуСКоронавирусом.НачалоПериода КАК НачалоПериода,
	|	СменыДокументаПереводНаРаботуСКоронавирусом.ОкончаниеПериода КАК ОкончаниеПериода,
	|	СменыДокументаПереводНаРаботуСКоронавирусом.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(СозданныеРанееРеестры.Ссылка, ЗНАЧЕНИЕ(Документ.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.ПустаяСсылка)) КАК РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам
	|ИЗ
	|	ВТСменыДокументаПереводНаРаботуСКоронавирусом КАК СменыДокументаПереводНаРаботуСКоронавирусом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСозданныеРанееРеестрыСрез КАК СозданныеРанееРеестрыСрез
	|		ПО (СозданныеРанееРеестрыСрез.Сотрудник = СменыДокументаПереводНаРаботуСКоронавирусом.Сотрудник)
	|			И (СозданныеРанееРеестрыСрез.НачалоПериода = СменыДокументаПереводНаРаботуСКоронавирусом.НачалоПериода)
	|			И (СозданныеРанееРеестрыСрез.ОкончаниеПериода = СменыДокументаПереводНаРаботуСКоронавирусом.ОкончаниеПериода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСозданныеРанееРеестры КАК СозданныеРанееРеестры
	|		ПО (СозданныеРанееРеестрыСрез.Сотрудник = СозданныеРанееРеестры.Сотрудник)
	|			И (СозданныеРанееРеестрыСрез.НачалоПериода = СозданныеРанееРеестры.НачалоПериода)
	|			И (СозданныеРанееРеестрыСрез.ОкончаниеПериода = СозданныеРанееРеестры.ОкончаниеПериода)
	|			И (СозданныеРанееРеестрыСрез.ДатаРеестра = СозданныеРанееРеестры.ДатаРеестра)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоПериода,
	|	ОкончаниеПериода,
	|	Сотрудник";
	Смены = Запрос.Выполнить().Выгрузить();
	
	Возврат Смены;
КонецФункции

Функция ПоляКлючаРеестра()
	
	ПоляКлючаВедомости = Новый Массив;
	ПоляКлючаВедомости.Добавить("НачалоПериода");
	ПоляКлючаВедомости.Добавить("ОкончаниеПериода");
	Возврат ПоляКлючаВедомости
	
КонецФункции

Функция КлючиРеестров(Смены, ПоляКлючаРеестра)
	
	КолонкиКлючаРеестра = СтрСоединить(ПоляКлючаРеестра, ", ");
	КлючиРеестров = Смены.Скопировать(, КолонкиКлючаРеестра);
	КлючиРеестров.Свернуть(КолонкиКлючаРеестра);
	
	Возврат КлючиРеестров;
	
КонецФункции

Функция СменаРеестра(КлючРеестра, СменыДокументаПереводНаРаботуСКоронавирусом)
	
	ПоляОтбораСмен = ОбщегоНазначения.ВыгрузитьКолонку(КлючРеестра.Владелец().Колонки, "Имя");
	
	ПараметрыОтбораСмен = Новый Структура(СтрСоединить(ПоляОтбораСмен, ", "));
	ЗаполнитьЗначенияСвойств(ПараметрыОтбораСмен, КлючРеестра);
	ПараметрыОтбораСмен.Вставить("РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам",Документы.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам.ПустаяСсылка());
	
	СменаРеестра = СменыДокументаПереводНаРаботуСКоронавирусом.Скопировать(ПараметрыОтбораСмен);
	
	Возврат СменаРеестра
	
КонецФункции

Функция НовыйРеестрПоКлючу(КлючВедомости, ОбщиеПараметрыЗаполнения, Сотрудники)
	
	ДокументМенеджер = Документы.РеестрСтимулирующихВыплатМедицинскимИСоциальнымРаботникам;
	
	Реестр = ДокументМенеджер.СоздатьДокумент();
	Реестр.УстановитьСсылкуНового(ДокументМенеджер.ПолучитьСсылку());
	
	ЗаполнитьЗначенияСвойств(Реестр, ОбщиеПараметрыЗаполнения);
	
	Реестр.Организация      = ОбщиеПараметрыЗаполнения.Организация;
	Реестр.НачалоПериода 	= КлючВедомости.НачалоПериода;
	Реестр.ОкончаниеПериода = КлючВедомости.ОкончаниеПериода;
	Реестр.МесяцНачисления  = НачалоМесяца(КлючВедомости.ОкончаниеПериода);
	Реестр.Дата             = КлючВедомости.ОкончаниеПериода;
	
	ДанныеПоСотрудникам = ДокументМенеджер.СведенияПоСотрудникамНаСервере(ОбщиеПараметрыЗаполнения.Организация, КлючВедомости.НачалоПериода, КлючВедомости.ОкончаниеПериода, Сотрудники);
	СменыРаботСотрудниковСКоронавирусом = ДокументМенеджер.СменыРаботСотрудниковСКоронавирусом(ОбщиеПараметрыЗаполнения.Организация, КлючВедомости.НачалоПериода, КлючВедомости.ОкончаниеПериода, ОбщиеПараметрыЗаполнения.ВидПособия, Сотрудники);
	
	СтруктураПоиска = Новый Структура("Сотрудник, Должность, КатегорияПолучателя");
	
	Для каждого СтрокаКадровыхДанных Из ДанныеПоСотрудникам Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаКадровыхДанных);
		РабочееВремяСотрудника = СменыРаботСотрудниковСКоронавирусом.НайтиСтроки(СтруктураПоиска);
		Если РабочееВремяСотрудника.Количество() = 0 Тогда
			Продолжить;
		ИначеЕсли РабочееВремяСотрудника[0].ДнейКОплате = 0
			И РабочееВремяСотрудника[0].СменКОплате = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокиСотрудника = Реестр.Сотрудники.НайтиСтроки(СтруктураПоиска);
		Если СтрокиСотрудника.Количество()>0 Тогда
			СтрокаТаблицы = СтрокиСотрудника[0];
		Иначе
			СтрокаТаблицы = Реестр.Сотрудники.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаКадровыхДанных);
		
		Если РабочееВремяСотрудника.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РабочееВремяСотрудника[0]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Реестр;
	
КонецФункции

#КонецОбласти

#Область Сохранение_ведомостей 

Функция ПроверитьРеестры(Реестры) Экспорт
	
	Отказ = Ложь;
	Для Каждого Реестр Из Реестры Цикл
		Если Не Реестр.ПроверитьЗаполнение() Тогда
			Сообщения = ПолучитьСообщенияПользователю(Ложь);
			Для Каждого Сообщение Из Сообщения Цикл
				Сообщение.КлючДанных = Реестр.ПолучитьСсылкуНового();
			КонецЦикла;
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Не Отказ
	
КонецФункции

Процедура СохранитьРеестры(Реестры, РежимЗаписи)	Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого Реестр Из Реестры Цикл
			Реестр.Записать(РежимЗаписи);
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр(
				"ru = 'Создание реестров стимулирующих выплат.Сохранение и проведение реестров'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		   
	    ВызватьИсключение;
	
	КонецПопытки;
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#КонецЕсли
